In [1]:
import pandas as pd

a = pd.read_csv('house_level_flemms.csv')

In [2]:
a.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls,Fuel for Lighting,Source of Water Supply for Drinking,Tenure Status of the Housing Unit/Lot,Sex,Single Year-Age Classification,Copy of Birth Certificate,Marital Status,Literacy,Highest Grade Completed,If graduate of Technical/Vocational Course,Overseas Worker
0,15707000010010000001000001,157001001,2,6.0,9.0,1.0,1.0,37.0,1.0,2.0,1.0,220.0,2.0,2.0
1,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,31.0,1.0,2.0,1.0,170.0,2.0,2.0
2,15707000010010000001000001,157001001,2,6.0,9.0,1.0,1.0,12.0,1.0,1.0,1.0,150.0,NaN,NaN
3,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,10.0,1.0,1.0,1.0,140.0,NaN,NaN
4,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,7.0,1.0,1.0,1.0,110.0,NaN,NaN

In [3]:
b = a.iloc[:, [0, 1, 7, 10]].drop_duplicates().reset_index(drop=True)

In [4]:
c = b[(b['Single Year-Age Classification'] <= 24) & (b['Single Year-Age Classification'] >= 6)]

In [5]:
c.head()

,CASE_ID,Bgy_Code,Single Year-Age Classification,Literacy
2,15707000010010000001000001,157001001,12.0,1.0
3,15707000010010000001000001,157001001,10.0,1.0
4,15707000010010000001000001,157001001,7.0,1.0
5,15707000010010000001000001,157001001,6.0,2.0
10,15707000010010000002000002,157001001,15.0,1.0

In [6]:
c['Single Year-Age Classification'].value_counts()

10.0    136270
7.0     125164
8.0     123500
6.0     120204
9.0     117484
15.0    116960
12.0    108534
13.0    101833
14.0    101248
11.0    100920
16.0     97880
20.0     90969
18.0     89413
17.0     86595
19.0     74222
21.0     68944
23.0     68780
22.0     68051
24.0     61527
Name: Single Year-Age Classification, dtype: int64

In [7]:
d = c.iloc[:, [1, 3]].reset_index(drop=True)

In [8]:
d.head()

    Bgy_Code  Literacy
0  157001001       1.0
1  157001001       1.0
2  157001001       1.0
3  157001001       2.0
4  157001001       1.0

In [9]:
d['Literacy'].value_counts()

1.0    1644243
2.0     214255
Name: Literacy, dtype: int64

In [10]:
e = d.groupby(d['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Literacy':'mean'}).reset_index(drop=True)

In [11]:
e.columns = ['Bgy_Code', 'Literacy of School Age Group 6-24']

In [12]:
e.head()

    Bgy_Code  Literacy of School Age Group 6-24
0  124702010                           1.037159
1  124702015                           1.053624
2  124702016                           1.097308
3  124702024                           1.049518
4  124702027                           1.072529

In [13]:
len(e)

2589

In [14]:
f = a.iloc[:, [0, 1, 7, 8]].drop_duplicates().reset_index(drop=True)

In [15]:
g = f[(f['Single Year-Age Classification'] <= 24) & (f['Single Year-Age Classification'] >= 6)]

In [16]:
g.head()

,CASE_ID,Bgy_Code,Single Year-Age Classification,Copy of Birth Certificate
2,15707000010010000001000001,157001001,12.0,1.0
3,15707000010010000001000001,157001001,10.0,1.0
4,15707000010010000001000001,157001001,7.0,1.0
5,15707000010010000001000001,157001001,6.0,1.0
10,15707000010010000002000002,157001001,15.0,1.0

In [17]:
h = g.iloc[:, [1, 3]].reset_index(drop=True)

In [18]:
h.head()

    Bgy_Code  Copy of Birth Certificate
0  157001001                        1.0
1  157001001                        1.0
2  157001001                        1.0
3  157001001                        1.0
4  157001001                        1.0

In [19]:
h['Copy of Birth Certificate'].value_counts()

1.0    1190577
2.0     642363
3.0      27550
9.0        578
Name: Copy of Birth Certificate, dtype: int64

In [20]:
h = h[h['Copy of Birth Certificate'] != 3]
h = h[h['Copy of Birth Certificate'] != 9]

In [21]:
h['Copy of Birth Certificate'].value_counts()

1.0    1190577
2.0     642363
Name: Copy of Birth Certificate, dtype: int64

In [22]:
import numpy as np

condition1 = [(h['Copy of Birth Certificate']  == 1)]
h['Has Copy Birth Certificate Proportion 6 - 24 yo'] = np.select(condition1, [1], 0)

In [23]:
h['Has Copy Birth Certificate Proportion 6 - 24 yo'].value_counts()

1    1190577
0     642363
Name: Has Copy Birth Certificate Proportion 6 - 24 yo, dtype: int64

In [24]:
h.head()

,Bgy_Code,Copy of Birth Certificate,Has Copy Birth Certificate Proportion 6 - 24 yo
0,157001001,1.0,1
1,157001001,1.0,1
2,157001001,1.0,1
3,157001001,1.0,1
4,157001001,1.0,1

In [25]:
i = h.iloc[:, [0, 2]].reset_index(drop=True)

In [26]:
i.head()

    Bgy_Code  Has Copy Birth Certificate Proportion 6 - 24 yo
0  157001001                                                1
1  157001001                                                1
2  157001001                                                1
3  157001001                                                1
4  157001001                                                1

In [27]:
j = i.groupby(i['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Has Copy Birth Certificate Proportion 6 - 24 yo':'mean'}).reset_index(drop=True)

In [28]:
j.head()

    Bgy_Code  Has Copy Birth Certificate Proportion 6 - 24 yo
0  124702010                                         0.749897
1  124702015                                         0.605769
2  124702016                                         0.440871
3  124702024                                         0.718328
4  124702027                                         0.545221

In [29]:
len(j)

2589

In [30]:
k = a.iloc[:, [0, 1, 7, 9]].drop_duplicates().reset_index(drop=True)

In [31]:
l = k[(k['Single Year-Age Classification'] <= 24) & (k['Single Year-Age Classification'] >= 6)]

In [32]:
l.head()

,CASE_ID,Bgy_Code,Single Year-Age Classification,Marital Status
2,15707000010010000001000001,157001001,12.0,1.0
3,15707000010010000001000001,157001001,10.0,1.0
4,15707000010010000001000001,157001001,7.0,1.0
5,15707000010010000001000001,157001001,6.0,1.0
10,15707000010010000002000002,157001001,15.0,1.0

In [33]:
m = l.iloc[:, [1, 3]].reset_index(drop=True)

In [34]:
m['Marital Status'].value_counts()

1.0    1720312
2.0     128135
4.0       4427
3.0       2910
5.0       2685
6.0        669
Name: Marital Status, dtype: int64

In [35]:
m = m[m['Marital Status'] != 6]

In [36]:
m['Marital Status'].value_counts()

1.0    1720312
2.0     128135
4.0       4427
3.0       2910
5.0       2685
Name: Marital Status, dtype: int64

In [37]:
condition2 = [(m['Marital Status'] == 1)]
m['Marriage Proportion'] = np.select(condition2, [0], 1)

In [38]:
m['Marriage Proportion'].value_counts()

0    1720312
1     138157
Name: Marriage Proportion, dtype: int64

In [39]:
m.head()

    Bgy_Code  Marital Status  Marriage Proportion
0  157001001             1.0                    0
1  157001001             1.0                    0
2  157001001             1.0                    0
3  157001001             1.0                    0
4  157001001             1.0                    0

In [40]:
n = m.iloc[:, [0, 2]].reset_index(drop=True)

In [41]:
n.head()

    Bgy_Code  Marriage Proportion
0  157001001                    0
1  157001001                    0
2  157001001                    0
3  157001001                    0
4  157001001                    0

In [42]:
o = n.groupby(n['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Marriage Proportion':'mean'}).reset_index(drop=True)

In [43]:
o.head()

    Bgy_Code  Marriage Proportion
0  124702010             0.151403
1  124702015             0.177013
2  124702016             0.204357
3  124702024             0.157014
4  124702027             0.148172

In [44]:
o.columns = ['Bgy_Code', 'Married Proportion 6 - 24 yo']

In [45]:
o.head()

    Bgy_Code  Married Proportion 6 - 24 yo
0  124702010                      0.151403
1  124702015                      0.177013
2  124702016                      0.204357
3  124702024                      0.157014
4  124702027                      0.148172

In [46]:
len(o)

2589

In [47]:
p = a.iloc[:, [0, 1, 7, 11]].drop_duplicates().reset_index(drop=True)

In [48]:
q = p[(p['Single Year-Age Classification'] <= 24) & (p['Single Year-Age Classification'] >= 6)]

In [49]:
q.head()

,CASE_ID,Bgy_Code,Single Year-Age Classification,Highest Grade Completed
2,15707000010010000001000001,157001001,12.0,150.0
3,15707000010010000001000001,157001001,10.0,140.0
4,15707000010010000001000001,157001001,7.0,110.0
5,15707000010010000001000001,157001001,6.0,10.0
10,15707000010010000002000002,157001001,15.0,220.0

In [50]:
r = q.iloc[:, [1, 3]].reset_index(drop=True)

In [51]:
#import numpy as np
condition3 = [(r['Highest Grade Completed'] == 0),
              (r['Highest Grade Completed'] == 10),
              (r['Highest Grade Completed'] == 110),
              (r['Highest Grade Completed'] == 120),
              (r['Highest Grade Completed'] == 130),
              (r['Highest Grade Completed'] == 999)
             ]
r['School Attendance after Grade 3 (6 - 24 yo)'] = np.select(condition3, [0,0,0,0,0,0], 1)

In [52]:
s = r.iloc[:, [0, 2]].reset_index(drop=True)

In [53]:
t = s.groupby(s['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'School Attendance after Grade 3 (6 - 24 yo)':'mean'}).reset_index(drop=True)

In [54]:
t.head()

    Bgy_Code  School Attendance after Grade 3 (6 - 24 yo)
0  124702010                                     0.617923
1  124702015                                     0.626033
2  124702016                                     0.531568
3  124702024                                     0.622533
4  124702027                                     0.514286

In [55]:
len(t)

2589

In [56]:
u = a.iloc[:, [0, 1, 13]].drop_duplicates().reset_index(drop=True)

In [57]:
v = u[u['Overseas Worker'] != 9]

In [58]:
w = v.replace([np.nan, 2], 0)

In [59]:
w.head()

                      CASE_ID   Bgy_Code  Overseas Worker
0  15707000010010000001000001  157001001              0.0
1  15707000010010000001000001  157001001              0.0
2  15707000010010000002000002  157001001              0.0
3  15707000010010000002000002  157001001              0.0
4  15707000010010000003000003  157001001              0.0

In [60]:
x = w.groupby(w['CASE_ID']).aggregate({'CASE_ID': 'first', 'Bgy_Code':'first', 'Overseas Worker': 'max'}).reset_index(drop=True)

In [61]:
x.head()

                      CASE_ID   Bgy_Code  Overseas Worker
0  12474700020100000001000001  124702010              0.0
1  12474700020100000002000002  124702010              0.0
2  12474700020100000003000003  124702010              0.0
3  12474700020100000004000004  124702010              0.0
4  12474700020100000005000005  124702010              1.0

In [62]:
y = x.iloc[:, [1, 2]].reset_index(drop=True)

In [63]:
y.head()

    Bgy_Code  Overseas Worker
0  124702010              0.0
1  124702010              0.0
2  124702010              0.0
3  124702010              0.0
4  124702010              1.0

In [64]:
z = y.groupby(y['Bgy_Code']).aggregate({'Bgy_Code':'first', 'Overseas Worker': 'mean'}).reset_index(drop=True)

In [65]:
z.columns = ['Bgy_Code', 'Overseas Worker in Family Proportion']

In [66]:
z.head()

    Bgy_Code  Overseas Worker in Family Proportion
0  124702010                              0.133525
1  124702015                              0.100629
2  124702016                              0.037037
3  124702024                              0.104238
4  124702027                              0.065350

In [67]:
len(z)

2589

In [68]:
educ_data1 = pd.merge(e, j)

In [69]:
educ_data2 = pd.merge(educ_data1, o)

In [70]:
educ_data3 = pd.merge(educ_data2, t)

In [71]:
educ_data4 = pd.merge(educ_data3, z)

In [72]:
educ_data4.head()

,Bgy_Code,Literacy of School Age Group 6-24,Has Copy Birth Certificate Proportion 6 - 24 yo,Married Proportion 6 - 24 yo,School Attendance after Grade 3 (6 - 24 yo),Overseas Worker in Family Proportion
0,124702010,1.037159,0.749897,0.151403,0.617923,0.133525
1,124702015,1.053624,0.605769,0.177013,0.626033,0.100629
2,124702016,1.097308,0.440871,0.204357,0.531568,0.037037
3,124702024,1.049518,0.718328,0.157014,0.622533,0.104238
4,124702027,1.072529,0.545221,0.148172,0.514286,0.065350

In [73]:
len(educ_data4)

2589

In [74]:
educ_data4.to_csv('educ_data_final.csv', index = False)

In [ ]:
b['Construction Materials of the Outer Walls'].value_counts()

In [ ]:
b = b[b['Construction Materials of the Outer Walls'] != 99]

In [ ]:
b['Construction Materials of the Outer Walls'].value_counts()

In [ ]:
import numpy as np


condition1 = [(b['Construction Materials of the Outer Walls'] == 1),
              (b['Construction Materials of the Outer Walls'] == 3),
              (b['Construction Materials of the Outer Walls'] == 4),
              (b['Construction Materials of the Outer Walls'] == 6),
              (b['Construction Materials of the Outer Walls'] == 7)
             ]
b['Household with Concrete Walls Proportion'] = np.select(condition1, [1,1,1,1,1], 0)

In [ ]:
b.head()

In [ ]:
c = b.iloc[:, [1] + [-1]]

In [ ]:
c.head()

In [ ]:
len(c)

In [ ]:
d = c.groupby(c['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Household with Concrete Walls Proportion':'sum'}).reset_index(drop=True)

In [ ]:
d['Household with Concrete Walls Proportion'] = (d['Household with Concrete Walls Proportion'] / len(c))*100.0

In [ ]:
d.head()

In [ ]:
len(d)

In [ ]:
e = a.iloc[:, [0, 1, 3]].drop_duplicates().reset_index(drop=True)
e = e.dropna()

In [ ]:
e.head()

In [ ]:
e['Fuel for Lighting'].value_counts()

In [ ]:
e = e[e['Fuel for Lighting'] != 9]

In [ ]:
e['Fuel for Lighting'].value_counts()

In [ ]:
condition2 = [(e['Fuel for Lighting'] == 1.0)]
e['Access to Electricity Proportion'] = np.select(condition2, [1], 0)

In [ ]:
e.head()

In [ ]:
f = e.iloc[:, [1] + [-1]]

In [ ]:
f.head()

In [ ]:
g = f.groupby(f['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Access to Electricity Proportion':'sum'}).reset_index(drop=True)

In [ ]:
g['Access to Electricity Proportion'] = (g['Access to Electricity Proportion'] / len(f))*100.0

In [ ]:
g.head()

In [ ]:
len(g)

In [ ]:
h = a.iloc[:, [0, 1, 4]].drop_duplicates().reset_index(drop=True)
h = h.dropna()

In [ ]:
h.head()

In [ ]:
h['Source of Water Supply for Drinking'].value_counts()

In [ ]:
h = h[h['Source of Water Supply for Drinking'] != 99]

In [ ]:
h['Source of Water Supply for Drinking'].value_counts()

In [ ]:
condition3 = [(h['Source of Water Supply for Drinking'] == 1),
              (h['Source of Water Supply for Drinking'] == 2),
              (h['Source of Water Supply for Drinking'] == 7),
              (h['Source of Water Supply for Drinking'] == 11)
             ]
h['Access to Treated Water Proportion'] = np.select(condition3, [1,1,1,1], 0)

In [ ]:
h.head()

In [ ]:
i = h.iloc[:, [1] + [-1]]

In [ ]:
i.head()

In [ ]:
j = i.groupby(i['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Access to Treated Water Proportion':'sum'}).reset_index(drop=True)

In [ ]:
j['Access to Treated Water Proportion'] = (j['Access to Treated Water Proportion'] / len(i))*100.0

In [ ]:
j.head()

In [ ]:
len(j)

In [ ]:
k = a.iloc[:, [0, 1, 5]].drop_duplicates().reset_index(drop=True)
k = k.dropna()

In [ ]:
k.head()

In [ ]:
k['Tenure Status of the Housing Unit/Lot'].value_counts()

In [ ]:
k = k[k['Tenure Status of the Housing Unit/Lot'] != 9]

In [ ]:
k['Tenure Status of the Housing Unit/Lot'].value_counts()

In [ ]:
condition4 = [(k['Tenure Status of the Housing Unit/Lot'] == 1)]
k['Owned House and Lot Proportion'] = np.select(condition4, [1], 0)

In [ ]:
k.head()

In [ ]:
l = k.iloc[:, [1] + [-1]]

In [ ]:
l.head()

In [ ]:
m = l.groupby(l['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Owned House and Lot Proportion':'sum'}).reset_index(drop=True)

In [ ]:
m['Owned House and Lot Proportion'] = (m['Owned House and Lot Proportion'] / len(l))*100.0

In [ ]:
m.head()

In [ ]:
len(m)

In [ ]:
household_data1 = pd.merge(d, g)#, j, m)

In [ ]:
household_data2 = pd.merge(household_data1, j)

In [ ]:
household_data3 = pd.merge(household_data2, m)

In [ ]:
household_data3.head()

In [ ]:
len(household_data3)

In [ ]:
household_data3.to_csv('household_data_final.csv', index = False)

In [ ]:
condition3 = [(b['Source of Water Supply for Drinking'] == 1),
              (b['Source of Water Supply for Drinking'] == 2),
              (b['Source of Water Supply for Drinking'] == 7),
              (b['Source of Water Supply for Drinking'] == 11)
             ]
b['Access to Treated Water Proportion'] = np.select(condition3, [1,1,1,1], 0)

In [ ]:
b['Access to Treated Water Proportion'].value_counts()

In [ ]:
condition4 = [(b['Tenure Status of the Housing Unit/Lot'] == 1)]
b['Owned House and Lot Proportion'] = np.select(condition4, [1], 0)

In [ ]:
b['Owned House and Lot Proportion'].value_counts()

In [ ]:
bb = b.iloc[:, [1] + [-1,-2,-3,-4]]

In [ ]:
bb.head()

In [ ]:
c = a.iloc[:, list(range(2)) + [-1,-2,-3,-4,-5,-6,-7,-8]]

In [ ]:
c.head()